**Importing**

In [137]:
import pandas as pd

**Reading data**

In [138]:
df = pd.read_csv("sample_data/california_housing_test.csv")
df

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

**Columns**

In [139]:
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

**Renaming** **columns**

In [140]:
df.rename(columns={'housing_median_age':'median_age','median_house_value':'median_value'})

      longitude  latitude  median_age  ...  households  median_income  median_value
0       -122.05     37.37        27.0  ...       606.0         6.6085      344700.0
1       -118.30     34.26        43.0  ...       277.0         3.5990      176500.0
2       -117.81     33.78        27.0  ...       495.0         5.7934      270500.0
3       -118.36     33.82        28.0  ...        11.0         6.1359      330000.0
4       -119.67     36.33        19.0  ...       237.0         2.9375       81700.0
...         ...       ...         ...  ...         ...            ...           ...
2995    -119.86     34.42        23.0  ...       607.0         1.1790      225000.0
2996    -118.14     34.06        27.0  ...      1036.0         3.3906      237200.0
2997    -119.70     36.30        10.0  ...       220.0         2.2895       62000.0
2998    -117.12     34.10        40.0  ...        14.0         3.2708      162500.0
2999    -119.63     34.42        42.0  ...       260.0         8.5608      500001.0

[3000 rows x 9 columns]

**Data Types of Columns**

In [141]:
df.dtypes

longitude             float64
latitude              float64
housing_median_age    float64
total_rooms           float64
total_bedrooms        float64
population            float64
households            float64
median_income         float64
median_house_value    float64
dtype: object

**Changing data type of a column**

In [142]:
df.housing_median_age = df['housing_median_age'].astype('float32')

In [143]:
df1=df.astype({'longitude':'float32','latitude':'float32'})
df1.dtypes

longitude             float32
latitude              float32
housing_median_age    float32
total_rooms           float64
total_bedrooms        float64
population            float64
households            float64
median_income         float64
median_house_value    float64
dtype: object

**Shape of dataframe**

In [144]:
df.shape

(3000, 9)

In [145]:
df.shape[0]

3000

**Unique values**

In [146]:
df['housing_median_age'].unique()

array([27., 43., 28., 19., 37., 15., 31., 45., 36., 16., 42., 26., 35.,
       40., 47., 13., 52., 32., 30., 14., 34., 17.,  5., 38., 33., 11.,
       48.,  4., 24.,  6., 21., 39., 10., 44., 18., 12., 22., 29., 46.,
       50., 20., 49., 25., 23., 41.,  8.,  3.,  7.,  9.,  2., 51.,  1.],
      dtype=float32)

**Total count in each category**

In [147]:
df.housing_median_age.value_counts()

52.0    173
35.0    118
36.0    115
16.0    107
34.0    102
17.0    100
32.0     91
26.0     88
37.0     88
25.0     86
33.0     85
15.0     77
18.0     76
19.0     76
30.0     76
24.0     75
29.0     75
27.0     74
38.0     64
20.0     63
21.0     61
22.0     60
28.0     58
14.0     57
31.0     57
41.0     56
43.0     56
39.0     55
23.0     53
42.0     51
44.0     51
45.0     51
40.0     43
11.0     41
12.0     41
46.0     41
13.0     41
5.0      39
48.0     34
10.0     30
4.0      28
9.0      27
6.0      25
8.0      25
47.0     22
49.0     21
7.0      20
50.0     16
3.0      12
51.0     11
2.0       6
1.0       2
Name: housing_median_age, dtype: int64

**Slicing in pandas**

In [148]:
df.loc[0:2,"longitude":"total_rooms"]

   longitude  latitude  housing_median_age  total_rooms
0    -122.05     37.37                27.0       3885.0
1    -118.30     34.26                43.0       1510.0
2    -117.81     33.78                27.0       3589.0

In [149]:
df.iloc[0:2,1:3]

   latitude  housing_median_age
0     37.37                27.0
1     34.26                43.0

In [150]:
df[::-1].head()

      longitude  latitude  ...  median_income  median_house_value
2999    -119.63     34.42  ...         8.5608            500001.0
2998    -117.12     34.10  ...         3.2708            162500.0
2997    -119.70     36.30  ...         2.2895             62000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2995    -119.86     34.42  ...         1.1790            225000.0

[5 rows x 9 columns]

In [151]:
df.iloc[0:8:2,-2:-4:-1]

   median_income  households
0         6.6085       606.0
2         5.7934       495.0
4         2.9375       237.0
6         1.6641       218.0

**Statistics**

In [152]:
df.describe()

         longitude    latitude  ...  median_income  median_house_value
count  3000.000000  3000.00000  ...    3000.000000          3000.00000
mean   -119.589200    35.63539  ...       3.807272        205846.27500
std       1.994936     2.12967  ...       1.854512        113119.68747
min    -124.180000    32.56000  ...       0.499900         22500.00000
25%    -121.810000    33.93000  ...       2.544000        121200.00000
50%    -118.485000    34.27000  ...       3.487150        177650.00000
75%    -118.020000    37.69000  ...       4.656475        263975.00000
max    -114.490000    41.92000  ...      15.000100        500001.00000

[8 rows x 9 columns]

In [153]:
df['median_income'].mean()

3.807271799999998

In [154]:
df.latitude.agg(['mean','max','min'])

mean    35.63539
max     41.92000
min     32.56000
Name: latitude, dtype: float64

**Duplicate values**

In [155]:
df['longitude'].duplicated().sum()

2393

In [156]:
df[~df.longitude.duplicated()]   #rows where duplicate longitude values are removed

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2853    -116.37     33.72  ...         3.0021            152300.0
2855    -118.70     34.28  ...         4.4964            238300.0
2947    -123.02     38.81  ...         3.0250            140600.0
2975    -120.71     35.50  ...         5.2508            292900.0
2995    -119.86     34.42  ...         1.1790            225000.0

[607 rows x 9 columns]

**Droping Duplicate values**

In [157]:
df.drop_duplicates(keep='first',subset=['longitude','latitude'])  #subset means to consider that columns only for duplicates

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2994    -117.93     33.86  ...         5.5867            182500.0
2995    -119.86     34.42  ...         1.1790            225000.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[2712 rows x 9 columns]

**DataFrame from Dictionary**

In [158]:
people = {'A':['Apple','Amazon','Aeroplane'],'B':['Banana','Bat','Ball'],'c':['Cat','Car','Camera']}
df2 = pd.DataFrame(people)
df2

           A       B       c
0      Apple  Banana     Cat
1     Amazon     Bat     Car
2  Aeroplane    Ball  Camera

**Group By in DataFrame**

In [159]:
g = df.groupby(df.housing_median_age)
g.latitude.mean()

housing_median_age
1.0     34.470000
2.0     35.793333
3.0     35.591667
4.0     34.962857
5.0     35.870769
6.0     35.573200
7.0     35.096500
8.0     35.499200
9.0     35.755556
10.0    36.084000
11.0    35.748780
12.0    35.385122
13.0    35.710244
14.0    36.494561
15.0    36.032727
16.0    35.860280
17.0    36.382200
18.0    35.955921
19.0    35.749474
20.0    36.117460
21.0    35.992623
22.0    36.115167
23.0    35.633396
24.0    35.507200
25.0    35.641279
26.0    35.486591
27.0    35.169459
28.0    35.301379
29.0    35.623733
30.0    35.254342
31.0    35.518772
32.0    35.486484
33.0    35.334706
34.0    35.124804
35.0    35.203644
36.0    35.163913
37.0    35.447500
38.0    35.524687
39.0    35.473091
40.0    35.410465
41.0    35.367321
42.0    35.310000
43.0    35.229821
44.0    35.575098
45.0    35.443333
46.0    35.587805
47.0    35.160909
48.0    35.479118
49.0    35.559524
50.0    36.627500
51.0    36.151818
52.0    36.427225
Name: latitude, dtype: float64

**Null values**

In [160]:
df.housing_median_age.isna().sum()
df.isna().sum()

longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
dtype: int64

**Fill Null values**

In [161]:
df.fillna(0)

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

**Sorting Data**

In [162]:
df.sort_values(by=['total_rooms','total_bedrooms'] , axis=0 , ascending=['True','False'],ignore_index=True)

      longitude  latitude  ...  median_income  median_house_value
0       -116.95     33.86  ...         1.6250             55000.0
1       -117.12     32.66  ...         1.1250             60000.0
2       -114.62     33.62  ...         0.5360            275000.0
3       -121.04     37.67  ...         0.5360            162500.0
4       -118.06     34.03  ...         2.3750            175000.0
...         ...       ...  ...            ...                 ...
2995    -117.12     33.49  ...         3.9963            191100.0
2996    -117.27     33.15  ...         4.6357            244900.0
2997    -116.36     33.78  ...         3.3799            239300.0
2998    -121.53     38.48  ...         4.8811            212200.0
2999    -117.20     33.58  ...         4.5936            174300.0

[3000 rows x 9 columns]

**Finding N largest/smallest values**

In [163]:
df.nlargest(4,columns=['housing_median_age','total_rooms'],keep='first')  #same as sort with ascending=False

      longitude  latitude  ...  median_income  median_house_value
1510    -122.43     37.79  ...         5.8543            500001.0
1346    -122.44     37.77  ...         4.4085            400000.0
2496    -122.27     41.20  ...         1.5923             56000.0
1780    -122.42     37.76  ...         3.3937            270000.0

[4 rows x 9 columns]

In [164]:
df.housing_median_age.nsmallest(5)

842     1.0
1115    1.0
495     2.0
1050    2.0
1271    2.0
Name: housing_median_age, dtype: float32

**Applying filter conditions**

In [165]:
filter = df['median_income']>df['median_income'].mean()
df[filter]

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
12      -121.93     37.25  ...         4.6900            252600.0
13      -117.03     32.97  ...         4.5625            231200.0
...         ...       ...  ...            ...                 ...
2991    -117.17     34.28  ...         7.1997            253800.0
2992    -122.33     37.39  ...         6.2263            500001.0
2993    -117.91     33.60  ...         5.1048            500001.0
2994    -117.93     33.86  ...         5.5867            182500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[1279 rows x 9 columns]

In [166]:
df1 = df[df.housing_median_age>50]
df1.reset_index(drop=True)

     longitude  latitude  ...  median_income  median_house_value
0      -122.42     37.76  ...         2.5403            250000.0
1      -122.53     37.97  ...         2.5125            270800.0
2      -121.92     37.33  ...         5.2831            299500.0
3      -118.20     33.77  ...         2.2344            200000.0
4      -122.43     37.74  ...         5.3292            300900.0
..         ...       ...  ...            ...                 ...
179    -122.42     37.79  ...         2.1343            400000.0
180    -122.44     37.71  ...         3.9567            251500.0
181    -122.47     37.77  ...         4.1635            398400.0
182    -118.14     34.17  ...         4.0524            173100.0
183    -122.33     37.39  ...         6.2263            500001.0

[184 rows x 9 columns]

In [167]:
l = (df.housing_median_age>50)
df[l].index

Int64Index([  26,   36,   70,   99,  109,  128,  157,  229,  232,  236,
            ...
            2882, 2892, 2900, 2908, 2927, 2950, 2965, 2970, 2972, 2992],
           dtype='int64', length=184)

In [168]:
df[~df.latitude.isna()]

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

**Adding a new column**

In [169]:
df['new_column'] = 0
df

      longitude  latitude  ...  median_house_value  new_column
0       -122.05     37.37  ...            344700.0           0
1       -118.30     34.26  ...            176500.0           0
2       -117.81     33.78  ...            270500.0           0
3       -118.36     33.82  ...            330000.0           0
4       -119.67     36.33  ...             81700.0           0
...         ...       ...  ...                 ...         ...
2995    -119.86     34.42  ...            225000.0           0
2996    -118.14     34.06  ...            237200.0           0
2997    -119.70     36.30  ...             62000.0           0
2998    -117.12     34.10  ...            162500.0           0
2999    -119.63     34.42  ...            500001.0           0

[3000 rows x 10 columns]

**Droping a column**

In [170]:
df.drop(columns=['new_column'])

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

**Pandas DataFrame is a collection of Series. Each column is of type Series.**

In [171]:
type(df.total_rooms)

pandas.core.series.Series

**Concatenate series to form DataFrame**

In [172]:
pd.concat([df.total_rooms,df.total_bedrooms],axis=1)

      total_rooms  total_bedrooms
0          3885.0           661.0
1          1510.0           310.0
2          3589.0           507.0
3            67.0            15.0
4          1241.0           244.0
...           ...             ...
2995       1450.0           642.0
2996       5257.0          1082.0
2997        956.0           201.0
2998         96.0            14.0
2999       1765.0           263.0

[3000 rows x 2 columns]

**Apply method**

In [173]:
import numpy as np

df.apply(np.max,axis=0)

longitude               -114.4900
latitude                  41.9200
housing_median_age        52.0000
total_rooms            30450.0000
total_bedrooms          5419.0000
population             11935.0000
households              4930.0000
median_income             15.0001
median_house_value    500001.0000
new_column                 0.0000
dtype: float64

In [174]:
df['age_ceil']=df.housing_median_age.apply(np.int)
df.age_ceil

0       27
1       43
2       27
3       28
4       19
        ..
2995    23
2996    27
2997    10
2998    40
2999    42
Name: age_ceil, Length: 3000, dtype: int64

**Titanic Dataset**

In [175]:
titanic_df=pd.read_csv('https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/fa71405126017e6a37bea592440b4bee94bf7b9e/titanic.csv')
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

**Create dummy variables for categorical columns**

In [176]:
pd.get_dummies(titanic_df.Embarked,prefix='Embarked').head()

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [177]:
pd.get_dummies(titanic_df,columns=['Embarked','Sex'],drop_first=True).head()

   PassengerId  Survived  Pclass  ... Embarked_Q  Embarked_S  Sex_male
0            1         0       3  ...          0           1         1
1            2         1       1  ...          0           0         0
2            3         1       3  ...          0           1         0
3            4         1       1  ...          0           1         0
4            5         0       3  ...          0           1         1

[5 rows x 13 columns]

**Apply String method**

In [178]:
titanic_df.Name.str.split(',').apply(lambda x:x[0])

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Name, Length: 891, dtype: object

**Change Display options in pandas**

In [179]:
pd.set_option('display.max_rows',None)

In [180]:
pd.reset_option('display.max_rows')

**Convert Continous data to categorical data**

In [181]:
pd.cut(titanic_df.Age,bins=[0,18,25,99],labels=['child','young_adult','adult'])

0      young_adult
1            adult
2            adult
3            adult
4            adult
          ...
886          adult
887    young_adult
888            NaN
889          adult
890          adult
Name: Age, Length: 891, dtype: category
Categories (3, object): ['child' < 'young_adult' < 'adult']

**Select column based on Data type**

In [182]:
titanic_df.select_dtypes(include=['number'])

     PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0              1         0       3  22.0      1      0   7.2500
1              2         1       1  38.0      1      0  71.2833
2              3         1       3  26.0      0      0   7.9250
3              4         1       1  35.0      1      0  53.1000
4              5         0       3  35.0      0      0   8.0500
..           ...       ...     ...   ...    ...    ...      ...
886          887         0       2  27.0      0      0  13.0000
887          888         1       1  19.0      0      0  30.0000
888          889         0       3   NaN      1      2  23.4500
889          890         1       1  26.0      0      0  30.0000
890          891         0       3  32.0      0      0   7.7500

[891 rows x 7 columns]